src/test/java/DataFiles/OrgReport_DEA_LimitedRestrict.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wshealthcare:(internal)@ver=${#Project#ver}">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:OrganizationReportRequest>
            <!--You may enter the following 6 items in any order-->
            <!--Optional:-->
            <urn:User>
                <!--You may enter the following 41 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:ExcludeDMVPII>true</urn:ExcludeDMVPII>
                <!--Optional:-->

                <!--Optional:-->
                <urn:DataRestrictionMask>0000000000000000000000000000</urn:DataRestrictionMask><urn:DataPermissionMask>11111111111111111111111111111111111111111111111111</urn:DataPermissionMask><urn:LnBranded>false</urn:LnBranded>
                <!--Optional:-->
                <urn:EndUser>
                    <!--You may enter the following 6 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                </urn:EndUser>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

            </urn:User>
            <!--Optional:-->
            <urn:RemoteLocations>
                <!--Zero or more repetitions:-->
                <urn:Item/>
            </urn:RemoteLocations>
            <!--Optional:-->
            <urn:ServiceLocations>
                <!--Zero or more repetitions:-->
                <urn:ServiceLocation>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->
                    <urn:Parameters>
                        <!--Zero or more repetitions:-->
                        <urn:Parameter>
                            <!--You may enter the following 2 items in any order-->
                            <!--Optional:-->

                            <!--Optional:-->

                        </urn:Parameter>
                    </urn:Parameters>
                </urn:ServiceLocation>
            </urn:ServiceLocations>
            <!--Optional:-->
            <urn:HealthcareConfig>
                <!--You may enter the following 2 items in any order-->
                <!--Optional:-->
                <!--type: string-->

                <!--Optional:-->
                <!--type: string-->

                <urn:Type>W</urn:Type><urn:ProductKey>1234</urn:ProductKey></urn:HealthcareConfig>
            <!--Optional:-->
            <urn:Options>

                <!--You may enter the following 33 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <urn:ReturnCount>50</urn:ReturnCount><urn:StartingRecord>1</urn:StartingRecord><urn:IncludeDEA>true</urn:IncludeDEA><urn:IncludeDOB>true</urn:IncludeDOB><urn:BestRules>HMS</urn:BestRules></urn:Options>
            <!--Optional:-->
            <urn:ReportBy>
                <!--You may enter the following 29 items in any order-->
                <!--Optional:-->
                <urn:LNFID>POZ222EJ4S</urn:LNFID>
                <!--Optional:-->

                <!--Optional:-->
                <urn:BusinessIds>
                    <!--You may enter the following 7 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                </urn:BusinessIds>
                <!--Optional:-->

                <!--Optional:-->
                <urn:Address>
                    <!--You may enter the following 18 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                </urn:Address>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:Licenses>
                    <!--Zero or more repetitions:-->
                    <urn:License>
                        <!--You may enter the following 3 items in any order-->
                        <!--Optional:-->

                        <!--Optional:-->

                        <!--Optional:-->

                    </urn:License>
                </urn:Licenses>
                <!--Optional:-->

                <!--Optional:-->
                <urn:DEANumbers>
                    <!--Zero or more repetitions:-->
                    <urn:DEANumber/>
                </urn:DEANumbers>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:NCPDPProviderID/><urn:Taxonomies>
                <!--Zero or more repetitions:-->
                <urn:Taxonomy/>
            </urn:Taxonomies>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:LegacyIds>
                    <!--Zero or more repetitions:-->
                    <urn:LegacyId>
                        <!--You may enter the following 2 items in any order-->
                        <!--Optional:-->

                        <!--Optional:-->

                    </urn:LegacyId>
                </urn:LegacyIds>
                <!--Optional:-->

                <!--Optional:-->

            </urn:ReportBy>
        </urn:OrganizationReportRequest>
    </soapenv:Body>
</soapenv:Envelope>